#다양한 출력 포맷
#빈 자리는 빈공간으로 두고, 오른쪽 정렬을 하되, 총 10자리 공간을 확보
#해석 : 중괄호 안의 0과10의 사이의 공백이 빈공간으로 두라는 것
        # 그리고 10이 총 10자리 공간을 확보하라는 것
        # > 이것이 오른쪽 정렬을 하라는 것
print("{0: >10}".format(500))


#양수일 땐 +로 표시, 음수일 땐  -로 표시
print("{0: >+10}".format(500))
print("{0: >+10}".format(-500))


#왼쪽 정렬하고, 빈칸을 _로 채움
print("{0:_<10}".format(500))

#3자리 마다 콤마를 찍어주기
print("{0:,}".format(100000))

#3자리 마다 콤마를 찍어주기, +- 부호도 붙이기
print("{0:+,}".format(10000000))
print("{0:+,}".format(-10000000))
#3자리 마다 콤마를 찍어주기, 부호도 붙이고, 자릿수 확보하기
#돈이 많으면 행복하니까 빈 자리느 ㄴ ^로 채워주기
print("{0:^<+30,}".format(100000000000))

#소수점 출력
print("{0:f}".format(5/3))
#소수점 특정 자리수 까지만 표시
print("{0:.2f}".format(5/3))