#문자열 포멧
#print("a"+ "b")

# #방법 1
# print("나는 %d살 입니다." %20)
# print("나는 %s를 좋아해요." %"파이썬")
# print("Apple 은  %c로 시작해요." %"A")

#%s
# print("나는 %s 살입니다." % 20)
# print("나는 %s색과 %s색을 좋아해요." %("파란색","노랑색"))

#방법 2
# print("나느 {}살 입니다." .format(20))
# print("나는 {}과 {}색을 좋아해요" .format("파란색","노랑색"))
# print("나는 {1}과 {0}색을 좋아해요" .format("파란색","노랑색"))


#방법3
#print("나는 {age}살이며, {color}색을 좋아해요" .format(age=27, color="파란색"))


#방법 4 (v3.6 이상~)
age =20
color = "빨간"
print(f"나는 {age}살 이며, {color}색을 좋아합니다.")        #f로 문장을 시작하면 선언한 변수의 값을 그대로 가져다 쓸수 있음